StaticThing = {

		openHole = 1, --打孔器

		linden = 2, --菩提子

		thing4 = 4, --破镜符

		thing5 = 5, --金刚心

		thing6 = 6, --突破石

		fireCrystal = 7, --火晶

		washRock = 8, --火能石

		silverNote10000 = 9, --银票

		silverNote5000 = 10, --银票

		soulSource = 12, --魂源

		thing13 = 13, --一阶生命魔核

		thing14 = 14, --二阶生命魔核

		thing15 = 15, --三阶生命魔核

		vip0Gift = 16, --vip0级礼包

		vip1Gift = 17, --vip1级礼包

		thing18 = 18, --四阶生命魔核

		thing19 = 19, --五阶生命魔核

		thing20 = 20, --六阶生命魔核

		thing21 = 21, --一阶物防魔核

		thing22 = 22, --二阶物防魔核

		thing23 = 23, --三阶物防魔核

		thing24 = 24, --四阶物防魔核

		thing25 = 25, --五阶物防魔核

		thing26 = 26, --六阶物防魔核

		thing27 = 27, --一阶法防魔核

		thing28 = 28, --二阶法防魔核

		thing29 = 29, --三阶法防魔核

		thing30 = 30, --四阶法防魔核

		thing31 = 31, --五阶法防魔核

		thing32 = 32, --六阶法防魔核

		thing33 = 33, --一阶物攻魔核

		thing34 = 34, --二阶物攻魔核

		thing35 = 35, --三阶物攻魔核

		thing36 = 36, --四阶物攻魔核

		thing37 = 37, --五阶物攻魔核

		thing38 = 38, --六阶物攻魔核

		thing39 = 39, --一阶法攻魔核

		thing40 = 40, --二阶法攻魔核

		thing41 = 41, --三阶法攻魔核

		thing42 = 42, --四阶法攻魔核

		thing43 = 43, --五阶法攻魔核

		thing44 = 44, --六阶法攻魔核

		recruitSign = 71, --兑换令

		peace = 72, --和平牌

		goldBox = 73, --金宝箱

		silverBox = 74, --银宝箱

		copperBox = 75, --铜宝箱

		goldKey = 76, --金钥匙

		silverKey = 77, --银钥匙

		copperKey = 78, --铜钥匙

		vigorPill = 79, --耐力丹

		energyPill = 80, --体力丹

		thing81 = 81, --装备锁

		refreshSign = 82, --刷新令

		thing83 = 83, --进阶石

		thing84 = 84, --蓝岩心石

		thing85 = 85, --紫岩心石

		specialGoldBox = 86, --金宝箱

		realmPill = 87, --境界丹

		wishWater = 88, --祝福水

		luckStore = 89, --幸运石

		thing90 = 90, --祥瑞珠

		thing91 = 91, --神魂凭证

		thing100 = 100, --并蒂莲

		thing101 = 101, --相思豆

		thing102 = 102, --合欢锁

		thing103 = 103, --连理枝

		thing104 = 104, --一线牵

		thing105 = 105, --同心结

		thing106 = 106, --红玫瑰

		thing107 = 107, --永恒钻戒

		thing108 = 108, --鸾凤古琴

		thing109 = 109, --巧克力

		holdStarThing = 110, --占星石

		thing111 = 111, --七阶生命魔核

		thing112 = 112, --七阶物攻魔核

		thing113 = 113, --七阶法攻魔核

		thing114 = 114, --七阶物防魔核

		thing115 = 115, --七阶法防魔核

		thing116 = 116, --八阶生命魔核

		thing117 = 117, --八阶物攻魔核

		thing118 = 118, --八阶法攻魔核

		thing119 = 119, --八阶物防魔核

		thing120 = 120, --八阶法防魔核

		thing121 = 121, --初级淬炼石

		thing122 = 122, --中级淬炼石

		thing123 = 123, --高级淬炼石

		thing124 = 124, --超级淬炼石

		thing125 = 125, --斗

		thing126 = 126, --破

		thing127 = 127, --苍

		thing128 = 128, --穹

		thing129 = 129, --圣

		thing130 = 130, --诞

		thing131 = 131, --快

		thing132 = 132, --乐

		thing133 = 133, --超

		thing134 = 134, --值

		thing135 = 135, --团

		thing136 = 136, --购

		thing137 = 137, --团购信物

		thing138 = 138, --圣诞信物 

		thing200 = 200, --玄重尺碎片

		thing206 = 206, --万魂剑碎片

		thing207 = 207, --骨皇刀碎片

		thing211 = 211, --寒冰魔枪碎片

		thing212 = 212, --紫月玄扇碎片

		thing218 = 218, --乾坤天斧碎片

		thing220 = 220, --月牙戟枪碎片

		thing222 = 222, --炼狱魔刀碎片

		thing231 = 231, --万魂冥甲碎片

		thing232 = 232, --骨皇圣衣碎片

		thing233 = 233, --玄重天甲碎片

		thing234 = 234, --修罗罡铠碎片

		thing235 = 235, --幻冥皇铠碎片

		thing238 = 238, --天魔火甲碎片

		thing240 = 240, --天玉战铠碎片

		thing241 = 241, --落英神铠碎片

		thing254 = 254, --玄重心链碎片

		thing256 = 256, --骨皇幽珠碎片

		thing257 = 257, --幽鬼项链碎片

		thing258 = 258, --天机锁链碎片

		thing260 = 260, --万魂灵玉碎片

		thing263 = 263, --雪魂丝链碎片

		thing264 = 264, --魔狱项链碎片

		thing265 = 265, --龙吟项链碎片

		thing266 = 266, --玄重帝冠碎片

		thing267 = 267, --骨皇之冕碎片

		thing268 = 268, --青炙头盔碎片

		thing269 = 269, --凌霄翼盔碎片

		thing270 = 270, --虹影面甲碎片

		thing273 = 273, --万魂冠碎片

		thing276 = 276, --圣灵头盔碎片

		thing277 = 277, --锈色之冠碎片

		thing278 = 278, --祥瑞天斧碎片

		thing279 = 279, --祥瑞丝甲碎片

		thing280 = 280, --祥瑞玉髓碎片

		thing281 = 281, --祥瑞灵盔碎片

		thing300 = 300, --超级境界丹

		thing301 = 301, --超级进阶石

		thing302 = 302, --灵宝精魄

		thing303 = 303, --万魂之源

		thing304 = 304, --异火灵石

		thing305 = 305, --神羽强化石

		thing306 = 306, --一阶神羽碎片

		thing307 = 307, --二阶神羽碎片

		thing308 = 308, --三阶神羽碎片

		thing500 = 500, --Q群礼包

		thing501 = 501, --公会礼包

		thing502 = 502, --渠道礼包

		thing503 = 503, --体验礼包1

		thing504 = 504, --体验礼包2

		thing505 = 505, --体验礼包3

		thing506 = 506, --体验礼包4

		thing507 = 507, --体验礼包5

		thing508 = 508, --体验礼包6

		thing509 = 509, --体验礼包7

		thing510 = 510, --体验礼包8

		thing511 = 511, --体验礼包9

		thing512 = 512, --体验礼包10

		thing513 = 513, --体验礼包11

		thing514 = 514, --体验礼包12

		thing515 = 515, --体验礼包13

		thing516 = 516, --体验礼包14

		thing517 = 517, --体验礼包15

		lihezuixiazhi = 1000, --极品橙色功法礼盒

		thing1001 = 1001, --橙色功法礼盒

		thing1002 = 1002, --紫色功法礼盒

		thing1003 = 1003, --极品橙色法宝礼盒

		thing1004 = 1004, --橙色法宝礼盒

		thing1005 = 1005, --紫色法宝礼盒

		thing1006 = 1006, --橙色英雄礼盒

		thing1007 = 1007, --紫色英雄礼盒

		thing1008 = 1008, --橙色装备礼盒

		thing1009 = 1009, --紫色装备礼盒

		thing1010 = 1010, --魔核礼盒

		thing1011 = 1011, --元宝礼盒

		thing1012 = 1012, --普天同庆礼盒

		thing1013 = 1013, --至尊宝盒

		thing1014 = 1014, --祥瑞套装礼盒

		thing1015 = 1015, --重阳礼盒

		thing1016 = 1016, --陨落心炎宝盒

		thing1017 = 1017, --超级进阶宝盒

		thing1018 = 1018, --海心焰宝盒

		thing1019 = 1019, --青莲地心火宝盒

		thing1020 = 1020, --斗魂宝盒

		thing1021 = 1021, --玄重套装礼盒

		thing1022 = 1022, --骨皇套装礼盒

		thing1023 = 1023, --超级境界宝盒

		thing1024 = 1024, --圣诞礼盒

		thing1025 = 1025, --拼手气礼盒

		groupBox = 1026, --团购宝箱

		bigGroupBox = 1027, --团购大宝箱

		lihezuidazhi = 1200 --幸运礼盒

}
