package mmo.common.ids;

public interface Heart {
	// 心法的ID从20000开始
	// ————————————————心法部分，ID从20000开始————————————————
	/** 空心法，适用于无心法技能或者是未装备心法的技能 */
	int kong = 20000;

	/** 缓释:治疗缓释，治疗总效果提升50% →调用buf_23实现*/
	int x_1 = 20001;
	/** 震神:附加buf反弹伤害,反弹30%的伤害 */
	int x_2 = 20002;
	/** 暴怒:加仇恨+120 */
	int x_3 = 20003;
	/** 杀意:加仇恨+50 */
	int x_4 = 20004;
	/** 迅疾:固伤+100 */
	int x_5 = 20005;
	/** 暴乱:固伤+160 */
	int x_6 = 20006;
	/** 神来:固伤+55 */
	int x_7 = 20007;
	/** 破碎:溅射+125 */
	int x_8 = 20008;
	/** 魔魇:吸血,吸取造成伤害的10% */
	int x_9 = 20009;
	/** 润物:清除掉血buf →4.掉血：debuf_4燃烧、debuf_5流血*/
	int x_10 = 20010;
	/** 速效:buf频率-1 */
	int x_11 = 20011;
	/** 熟稔:二连击 */
	int x_12 = 20012;
	/** 精研:三连击 */
	int x_13 = 20013;
	/** 一气:技能冷却时间-15% */
	int x_14 = 20014;
	/** 感应:技能冷却时间-25% */
	int x_15 = 20015;
	/** 汹涌:水攻提升+75 */
	int x_16 = 20016;
	/** 厚土:土防提升+65 */
	int x_17 = 20017;
	/** 护元:五行防提升+55 */
	int x_18 = 20018;
	/** 融灵:固疗+65 */
	int x_19 = 20019;
	/** 凝神:技能双倍治疗 */
	int x_20 = 20020;
	/** 纯熟:技能消耗-15% */
	int x_21 = 20021;
	/** 聚气:技能消耗-30% */
	int x_22 = 20022;
	/** 灵动:技能消耗-50% */
	int x_23 = 20023;
	/** 分力:二目标 */
	int x_24 = 20024;
	/** 无痕:三目标 */
	int x_25 = 20025;
	/** 锋锐:BB攻击提升10% */
	int x_26 = 20026;
	/** 灵犀:BB治疗效果提升20% */
	int x_27 = 20027;
	/** 瞬移:清除减速 →7.减速：debuf_8冻僵*/
	int x_28 = 20028;
	/** 借力:伤害吸收 →buf_12剑盾（抵消伤害）*/
	int x_29 = 20029;
	/** 挪移:MP替代伤害 */
	int x_30 = 20030;
	/** 奇袭:BB攻击频率-1秒，即冷却时间-1000 */
	int x_31 = 20031;
	/** 定魄:BB治疗频率-1秒，即冷却时间-1000 */
	int x_32 = 20032;
	/** 驱邪:二重治疗 */
	int x_33 = 20033;
	/** 炼骨:附带buf燃烧 */
	int x_34 = 20034;
	/** 承运:清除减攻 →11.减攻：debuf_13天击 */
	int x_35 = 20035;
	/** 灭魂:火攻提升+75 */
	int x_36 = 20036;
	/** 混元:范围扩大+2尺 */
	int x_37 = 20037;
	/** 幻象:范围扩大+5尺 */
	int x_38 = 20038;
	/** 寻隙:无视闪避-20% */
	int x_39 = 20039;
	/** 精修:buf持续时间+3 */
	int x_40 = 20040;
	/** 绵长:buf持续时间+6 */
	int x_41 = 20041;
	/** 回神:buf效果+10% */
	int x_42 = 20042;
	/** 通脉:buf效果+15% */
	int x_43 = 20043;
	/** 破绽:技能暴击率+15% */
	int x_44 = 20044;
	/** 明悟:附加buf加暴击率 */
	int x_45 = 20045;
	/** 破击:技能暴击倍数+50% */
	int x_46 = 20046;
	/** 回魂:技能回复+15% */
	int x_47 = 20047;
	/** 清淤:技能回复+8% */
	int x_48 = 20048;
	/** 坚韧:附带buf防御，防御增强10% */
	int x_49 = 20049;
	/** 溶金:金攻提升+75 */
	int x_50 = 20050;
	/** 轻身:附加buf闪避260点 →共用13.加闪避：buf_15灵巧*/
	int x_51 = 20051;
	/** 通透:无视防御-25% */
	int x_52 = 20052;
	/** 碎击:技能伤害+20% */
	int x_53 = 20053;
	/** 贯通:技能伤害+30% */
	int x_54 = 20054;
}
