package mmo.common.ids;

public interface SkillId {
	// 这里包含全部秘籍、技能、buff的ID分配
	// 秘籍ID从10000开始；技能ID——玄仙从1001开始，修罗从2001开始、御灵从3001开始；buffID从8000开始；

	// ————————————————技能的ID部分，技能ID玄仙从1001开始，修罗从2001开始、御灵从3001开始——————————————
	/** 第一个技能ID，空出来不管 */
	int skill                 = 100;
	int ska_4                 = 1004;
	int skb_4                 = 2004;
	int skc_4                 = 3004;
	int ska_5                 = 1005;
	int skb_5                 = 2005;
	int skc_5                 = 3005;
	int skc_6                 = 3006;
	int skc_7                 = 3007;
	int skc_12                = 3012;
	int skc_13                = 3013;
	// ————————————————宠物和怪物技能从7000开始,7000-7999——————————————
	int skf_0                 = 7001; // 煞体BB技能的ID
	int skf_1                 = 7002; // 灵体BB技能的ID

	// ————————————————buff的ID部分，buff的ID从8000开始，这里包括状态区域,8000-8999——————————————
	/**
	 * buf类型统计 1.禁止移动施法：debuf_1幻形、debuf_2冰封、debuf_3眩晕 2.区域伤害：debuf_6阴煞、area_20焚火 3.区域治疗：area_21甘霖、
	 * 4.掉血：debuf_4燃烧、debuf_5流血 5.转化/抵消/反弹伤害：buf_22挪移（转化伤害）、buf_12剑盾（抵消伤害）、buf_24反弹(反弹伤害) 6.召唤BB专用：buf_16仙灵体、buf_17煞魂体
	 * 7.减速：debuf_8冻僵 8.加速：buf_7柔风 9.加防：buf_9土甲、buf_10象甲 10.减防：debuf_11破击 11.减攻：debuf_13天击 12.减命中：debuf_14震慑
	 * 13.加闪避：buf_15灵巧 14.治疗：buf_23缓释
	 */
	/** 第一个bufID，空出来不管 */
	int buf                   = 8999;
	/** 反弹，特殊属性附加buf */
	int buf_rebound           = 8035;
	/** 麻痹，特殊属性附加 */
	int debuf_0               = 8000;
	/** 幻形(禁止移动施法)，玄仙/幻形诀=ska_12 */
	int debuf_1               = 8001;
	/** 冰封(禁止移动施法)，玄仙/玄冰诀=ska_8 */
	int debuf_2               = 8002;
	/** 眩晕(禁止移动施法)，修罗skb_4/skb_8，御灵skc_4 */
	int debuf_3               = 8003;
	/** 燃烧(掉血)，玄仙ska_6/ska_9 */
	int debuf_4               = 8004;
	/** 流血(掉血)，修罗skb_12 */
	int debuf_5               = 8005;
	/** 阴煞(区域伤害)，御灵skc_10 */
	int debuf_6               = 8006;
	/** 柔风，御灵skc_11 */
	int buf_7                 = 8007;
	/** 冻僵(减速)，玄仙ska_7 */
	int debuf_8               = 8008;
	/** 土甲(加防)，玄仙ska_10/ska_11 */
	int buf_9                 = 8009;
	/** 象甲(加防)，修罗skb_11 */
	int buf_10                = 8010;
	/** 破击(减防)，修罗skb_6 */
	int debuf_11              = 8011;
	/** 剑盾(转化/抵消伤害)，玄仙ska_10 */
	int buf_12                = 8012;
	/** 天击(减攻)，修罗skb_7 */
	int debuf_13              = 8013;
	/** 震慑(减命中)，修罗skb_13 */
	int debuf_14              = 8014;
	/** 灵巧(加闪避)，修罗skb_10 */
	int buf_15                = 8015;
	/** 仙灵体(召唤BB专用)，御灵skc_12 */
	int buf_16                = 8016;
	/** 煞魂体(召唤BB专用)，御灵skc_13 */
	int buf_17                = 8017; // buf_煞魂(增强BB效果，同时增强攻击力和恢复力)；煞魂之体，skc_13
	// int buf_a = 8018; // 暴击标识，判断玄仙和御灵
	// int buf_b = 8019; // 闪避标识，判断修罗
	/** 焚火(区域伤害)，玄仙ska_9 */
	int area_20               = 8020;
	/** 甘霖(区域治疗)，御灵skc_9 */
	int area_21               = 8021;
	/** 挪移(转化/抵消伤害)-用于心法x_30，玄仙ska_11， */
	int buf_22                = 8022;
	/** 缓释(治疗)-用于心法x_1，御灵buf=area_21甘霖，创建于御灵skc_9 */
	int buf_23                = 8023;
	/** 反弹-用于心法 */
	int buf_24                = 8024;
	/** 场景冰冻-副本寒冰窟创建的场景冰冻区域造成的实际伤害 */
	int debuf_ice             = 8032;
	/** 场景灼伤-副本烈焰洞创建的场景灼伤区域造成的实际伤害 */
	int debuf_fire            = 8034;

	/** 神来，用于skf_0，增加55点固定伤害 */
	int buf_x_7               = 8025;
	/** 溅射，用于skf_0，增加125点溅射伤害 */
	int buf_x_8               = 8026;
	/** 寻隙，用于skf_0，无视闪避-20% */
	int buf_x_39              = 8027;
	/** 融灵，用于skf_1，固疗+65 */
	int buf_x_19              = 8028;
	/** 凝神，用于skf_1，技能双倍治疗 */
	int buf_x_20              = 8029;
	/** 灵犀，用于skf_1，BB治疗效果提升20% */
	int buf_x_27              = 8030;

	// ————————————————道具类技能从9000开始,9000-9999——————————————
	/** 宗门神兽经验道具-修为丹，增加宗门神兽经验=12*神兽lv^2+400 */
	int goods_moster_exp      = 9028;
	/** 宗门神兽开心度道具-琼浆玉液(凡)，40%几率提升宗门神兽1点开心度 */
	int goods_moster_mood_a   = 9029;
	/** 宗门神兽开心度道具-琼浆玉液(灵)，50%几率提升宗门神兽1点开心度 */
	int goods_moster_mood_b   = 9030;
	/** 宗门神兽开心度道具-琼浆玉液(仙)，60%几率提升宗门神兽1点开心度 */
	int goods_moster_mood_c   = 9031;
	/** 宗门神兽开心度道具-琼浆玉液(神)，70%几率提升宗门神兽1点开心度 */
	int goods_moster_mood_d   = 9032;
	/** 技能道具-境界丹，只可使用一次，增加100W境界点 */
	int goods_realm_add100W   = 9033;
	/** 经验道具-升级宝珠，只可使用一次，等级提升一级 */
	int goods_exp_uplevle     = 9000;
	/** 经验道具-双倍经验，只可使用一次，30分钟内打怪获取的经验双倍 */
	int goods_exp_double      = 9004;
	/** 经验道具-老君仙丹，只可使用一次，30分钟内每5分钟获取一次经验 */
	int goods_exp_add500      = 9005;
	/** 属性buf道具-风行仙丹,速度+50% */
	int goods_buf_addspeed    = 9006;
	/** 属性buf道具-龟甲仙丹，防御+15% */
	int goods_buf_adddef      = 9007;
	/** 属性buf道具-虎力仙丹，攻击+15% */
	int goods_buf_addatk      = 9008;
	/** HP药品-化血丹+200 */
	int goods_add_hp200       = 9001;
	/** HP药品-辟谷丹+300 */
	int goods_add_hp300       = 9009;
	/** HP药品-护心丸+700 */
	int goods_add_hp700       = 9010;
	/** HP药品-血心丸+300 */
	int goods_add_hp1500      = 9011;
	/** MP药品-益气散+200 */
	int goods_add_mp200       = 9002;
	/** MP药品-养精丹+300 */
	int goods_add_mp300       = 9012;
	/** MP药品-百草丹+700 */
	int goods_add_mp700       = 9013;
	/** MP药品-回气丹+1500 */
	int goods_add_mp1500      = 9014;
	/** HP药品-黄龙丹+15% */
	int goods_add_hp_per15    = 9015;
	/** HP药品-金髓丸+30% */
	int goods_add_hp_per30    = 9016;
	/** HP药品-真元丹+50% */
	int goods_add_hp_per50    = 9017;
	/** MP药品-合气丹+15% */
	int goods_add_mp_per15    = 9018;
	/** MP药品-炼气散+30% */
	int goods_add_mp_per30    = 9019;
	/** MP药品-聚灵丹+50% */
	int goods_add_mp_per50    = 9020;
	/** 绑定灵石道具-银票，只可使用一次，加100W灵石 */
	int goods_money_note      = 9003;
	/** 绑定灵石道具-初级灵石袋(小)，只可使用一次，加10灵石 */
	int goods_getmoney_10     = 9023;
	/** 绑定灵石道具-初级灵石袋(大)，只可使用一次，加50灵石 */
	int goods_getmoney_50     = 9024;
	/** 绑定灵石道具-中级灵石袋(小)，只可使用一次，加100灵石 */
	int goods_getmoney_100    = 9025;
	/** 绑定灵石道具-中级灵石袋(大)，只可使用一次，加500灵石 */
	int goods_getmoney_500    = 9026;
	/** 绑定灵石道具-高级灵石袋(小)，只可使用一次，加2000灵石，比这个更高就用极品灵石 */
	int goods_getmoney_2000   = 9027;

	/** 属性buf道具-火阳丹，抵御寒气的灵丹，不受寒气影响（场景debuf_ice） */
	int goods_buf_resist_ice  = 9021;
	/** 属性buf道具-玄冰丹，抵御烈焰的灵丹，不受烈焰影响（场景debuf_fire） */
	int goods_buf_resist_fire = 9022;

	/** 蕴灵丹对应的BUF-id */
	int add_exp_11071         = 9034;
	int add_exp_11072         = 9035;
	int add_exp_11073         = 9036;

	// ----------------------HD版技能ID-----start----------------
	// ----单体-辅助-友方-技能ID-------start--------------
	/** 金治愈-驱散金 */
	int id_4801               = 4801;
	/** 木治愈-驱散木 */
	int id_4803               = 4803;
	/** 水治愈-驱散水 */
	int id_4805               = 4805;
	/** 火治愈-驱散火 */
	int id_4807               = 4807;
	/** 土治愈-驱散土 */
	int id_4809               = 4809;

	/** 毒免疫 */
	int id_4810               = 4810;
	/** 迟缓免疫 */
	int id_4811               = 4811;
	/** 燃烧免疫 */
	int id_4812               = 4812;
	/** 石球免疫 */
	int id_4813               = 4813;
	/** 中毒免疫阵 */
	int id_4824               = 4824;
	/** 中毒迟缓免疫 */
	int id_4826               = 4826;
	/** 中毒燃烧免疫 */
	int id_4828               = 4828;
	/** 中毒石球免疫 */
	int id_4830               = 4830;
	/** 迟缓免疫 */
	int id_4832               = 4832;
	/** 迟缓石球免疫 */
	int id_4834               = 4834;
	/** 燃烧免疫 */
	int id_4836               = 4836;
	/** 燃烧石球免疫 */
	int id_4838               = 4838;
	/** 落石免疫 */
	int id_4840               = 4840;
	// ----单体-辅助-友方-技能ID-------end--------------

	// ---------------------HD版技能_ID----end-----------------

	// ---------------------HD版BUF_ID----start----------------
	/** 眩晕 */
	int id_5000               = 5000;
	/** 石化 */
	int id_5001               = 5001;
	/** 迟缓 */
	int id_5002               = 5002;
	/** 吸血 */
	int id_5003               = 5003;
	/** 冰冻 */
	int id_5004               = 5004;
	/** 燃烧 */
	int id_5005               = 5005;
	/** 击倒 */
	int id_5006               = 5006;
	/** 击退 */
	int id_5007               = 5007;
	/** 定身 */
	int id_5008               = 5008;
	/** 恐惧 */
	int id_5009               = 5009;
	/** 混乱 */
	int id_5010               = 5010;
	/** 中毒 */
	int id_5011               = 5011;
	/** 反弹 */
	int id_5012               = 5012;

	/** 阻挡 */
	int id_5100               = 5100;
	/** 备用 */
	int id_5101               = 5101;
	/** 备用 */
	int id_5102               = 5102;
	/** 备用 */
	int id_5103               = 5103;
	/** 备用 */
	int id_5104               = 5104;
	/** 备用 */
	int id_5105               = 5105;
	/** 免疫木 */
	int id_5106               = 5106;
	/** 免疫水 */
	int id_5107               = 5107;
	/** 免疫火 */
	int id_5108               = 5108;
	/** 免疫土 */
	int id_5109               = 5109;
	/** 回血阵法 */
	int id_5110               = 5110;
	/** 毒雾阵法 */
	int id_5111               = 5111;
	/** 地火阵法 */
	int id_5112               = 5112;
	/** 地雷阵法 */
	int id_5113               = 5113;
	/** 暴风雨阵法 */
	int id_5114               = 5114;
	/** 迟缓阵法 */
	int id_5115               = 5115;
	/** 熔岩阵法 */
	int id_5116               = 5116;
	/** 雷阵法 */
	int id_5117               = 5117;
	/** 落石阵法 */
	int id_5118               = 5118;
	/** 备用 */
	int id_5119               = 5119;
	/** 备用 */
	int id_5120               = 5120;
	/** 备用 */
	int id_5121               = 5121;

	/** 攻击光环 */
	int id_5200               = 5200;
	/** 防御光环 */
	int id_5201               = 5201;
	/** 生命光环 */
	int id_5202               = 5202;
	/** 备用 */
	int id_5203               = 5203;
	/** 备用 */
	int id_5204               = 5204;
	/** 备用 */
	int id_5205               = 5205;
	// --------------------------------------------------------------
}
